SoapRequest

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://Web">
   <soapenv:Header/>
   <soapenv:Body>
      <web:getInteractionsWithProblems>
        	<web:idMedico>pino</web:idMedico>
         	<web:peso>67</web:peso>
			<web:edad>72</web:edad>
			<web:sexo>M</web:sexo>
			<web:medicaciones>_10</web:medicaciones>
			<web:conditions>emb</web:conditions>
		</web:getInteractionsWithProblems>
	</soapenv:Body>
</soapenv:Envelope>